chtMultiregionFoam/Di_numberlow/system/oil/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/oil";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default 	CrankNicolson 0.9;
}

gradSchemes
{
    default         cellMDLimited Gauss linear 1;
}

divSchemes
{
    default         none;

    div(phi,U)      Gauss upwind;
    div(phi,K)      Gauss upwind;
    div(phi,h)      Gauss upwind;
    div(phi,k)      Gauss upwind;
    div(phi,epsilon) Gauss upwind;
//    div(phi,R)      Gauss upwind;
//    div(R)          Gauss linear;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss upwind phi;
}

laplacianSchemes
{
    default         Gauss linear limited corrected 0;
}

interpolationSchemes:
{
    default         linear;
}

snGradSchemes
{
    default         limited corrected 0;
}


// ************************************************************************* //
